Revit 2024 API
ExportLayerKey Constructor (String, String, SpecialType)
 Constructs a new ExportLayerKey with categoryName, subCategoryName and a special type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ExportLayerKey(
	string categoryName,
	string subCategoryName,
	SpecialType num
)
Visual Basic
Public Sub New ( _
	categoryName As String, _
	subCategoryName As String, _
	num As SpecialType _
)
Visual C++
public:
ExportLayerKey(
	String^ categoryName,
	String^ subCategoryName,
	SpecialType num
)
Parameters
categoryName
Type: System.String
 The category name for the layer key.
subCategoryName
Type: System.String
 The subCategoryName for the layer key.
num
Type: Autodesk.Revit.DB.SpecialType
 The special type for layer key.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ExportLayerKey Class
ExportLayerKey Overload
Autodesk.Revit.DB Namespace